products = [
    {"назва товару": "Ноутбук", "кількість": 5, "ціна за одиницю": 30000, "категорія": "електроніка"},
    {"назва товару": "Смартфон", "кількість": 10, "ціна за одиницю": 18000, "категорія": "електроніка"},
    {"назва товару": "Футболка", "кількість": 25, "ціна за одиницю": 350, "категорія": "одяг"},
    {"назва товару": "Куртка", "кількість": 12, "ціна за одиницю": 1500, "категорія": "одяг"},
    {"назва товару": "Хліб", "кількість": 40, "ціна за одиницю": 25, "категорія": "продукти"},
    {"назва товару": "Молоко", "кількість": 30, "ціна за одиницю": 30, "категорія": "продукти"},
    {"назва товару": "Навушники", "кількість": 8, "ціна за одиницю": 800, "категорія": "електроніка"}
]

print("{:<15} {:<10} {:<17} {:<15}".format("Назва товару", "Кількість", "Ціна за одиницю", "Категорія"))
print("-" * 65)
for product in products:
    print("{:<15} {:<10} {:<17} {:<15}".format(
        product["назва товару"],
        product["кількість"],
        product["ціна за одиницю"],
        product["категорія"]
    ))